In [56]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import re
import datetime

Entre las tareas que tendréis que hacer hoy:

- Al empezar a trabajar con este dataframe ya eliminamos algunas columnas que a priori no nos interesaban. Ahora llega el momento de eliminar alguna columna más. En este caso vamos tendréis que eliminar las columnas que no nos sean útiles para contestar a nuestras preguntas. Pero ojo ⚠️, haced una copia del dataframe para no "cargarnos" el dataframe original y perder la info.

- ¿Hay valores duplicados en nuestro dataframe? En caso de que los haya, eliminándolos.

- Como hemos visto, algunas columnas no tienen el tipo de datos que deberían. Cambiad el tipo de dato para la columna de year.

- En la columna de country poner todos los valores en minúsculas. Pista Tendréis que usar una función o una lambda

- Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza.

In [57]:
df = pd.read_csv('../../datos/attacks.csv', index_col=0)

In [58]:
df.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,injury,date,mes,fatal_,sex2
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,"FATAL, all onboard were killed by sharks",1800,NaN,y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,FATAL,Reported May-28-1797,May,y,NaN

Eliminaremos algunas columnas que no son de nuestro interés como: name, location, href, time, area, location, injury y date (de esta última ya extrajimos la información de los meses y además ya tenemos una columna de años)

In [59]:
df_copia = df.copy()

In [60]:
df_copia.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'age', 'time', 'species_', 'href', 'injury', 'date',
       'mes', 'fatal_', 'sex2'],
      dtype='object')

In [61]:
df_copia.drop(['location', 'href', 'date', 'name', 'time', 'area', 'injury'], axis=1, inplace=True)

In [62]:
df_copia.head(2)

,case_number,year,type,country,activity,age,species_,mes,fatal_,sex2
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,a corsair's boat was overturned,NaN,NaN,NaN,y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,Dropped overboard,NaN,NaN,May,y,NaN

In [63]:
nulos = pd.DataFrame(round(df_copia.isnull().sum() * 100 / df.shape[0], 2))
nulos.rename(columns={0:'% nulos'}, inplace=True)
nulos

             % nulos
case_number     0.02
year            0.00
type            0.06
country         0.80
activity        8.63
age            44.88
species_       45.05
mes             9.07
fatal_          9.66
sex2            8.98

In [64]:
df_copia.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6284 entries, 0 to 6283
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   case_number  6283 non-null   object
 1   year         6284 non-null   float64
 2   type         6280 non-null   object
 3   country      6234 non-null   object
 4   activity     5742 non-null   object
 5   age          3464 non-null   object
 6   species_     3453 non-null   object
 7   mes          5714 non-null   object
 8   fatal_       5677 non-null   object
 9   sex2         5720 non-null   object
dtypes: float64(1), object(9)
memory usage: 540.0+ KB

In [65]:
# DUPLICADOS

df_copia.duplicated().sum()

0

In [66]:
# TIPO DE DATOS

df_copia["year"] = df_copia["year"].astype('Int64', errors = "ignore")

In [67]:
df_copia.dtypes

case_number    object
year            Int64
type           object
country        object
activity       object
age            object
species_       object
mes            object
fatal_         object
sex2           object
dtype: object

In [68]:
df_copia['year'].unique()

<IntegerArray>
[1800, 1797, 1792, 1791, 1788, 1787, 1786, 1785, 1784, 1783,
 ...
 1812, 1811, 1810, 1808, 1807, 1805, 1804, 1803, 1802, 1801]
Length: 249, dtype: Int64

In [69]:
df_copia['country'].unique()

array(['SEYCHELLES', nan, 'ENGLAND', 'AUSTRALIA', 'BARBADOS', 'JAMAICA',
       'MARTINIQUE', 'USA', 'GUINEA', 'GREENLAND', 'FRANCE', 'SPAIN',
       'MEDITERRANEAN SEA', 'CUBA', 'SWEDEN', 'PANAMA', 'ITALY',
       'ICELAND', 'ROATAN', 'INDIA', 'Between PORTUGAL & INDIA',
       'VENEZUELA', 'MEXICO', 'GREECE', 'CANADA', 'KENYA', 'URUGUAY',
       'PAPUA NEW GUINEA', 'BERMUDA', 'LEBANON', 'SUDAN', 'DJIBOUTI',
       'LIBYA', 'NEW ZEALAND', 'VIETNAM', 'SRI LANKA', 'MOZAMBIQUE',
       'SOUTH AFRICA', 'BAHREIN', 'BAHAMAS', 'REUNION', 'SOLOMON ISLANDS',
       'KOREA', 'FRENCH POLYNESIA', 'VANUATU', 'IRAN', 'RED SEA?',
       'SINGAPORE', 'FIJI', 'IRAQ', 'MADAGASCAR', 'INDONESIA',
       'NICARAGUA', 'MARSHALL ISLANDS', 'KIRIBATI', 'NORTH PACIFIC OCEAN',
       'SAUDI ARABIA', 'PACIFIC OCEAN', 'BURMA', 'BELIZE', 'ASIA?',
       'CEYLON (SRI LANKA)', 'BRAZIL', 'THAILAND', 'COSTA RICA',
       'MALDIVES', 'NEW CALEDONIA', 'ECUADOR', 'MALAYSIA', 'MAURITIUS',
       'SAMOA', 'JAPAN', 'EGYPT', 'ST HELENA, British overseas territory',
       'COMOROS', 'UNITED KINGDOM', 'UNITED ARAB EMIRATES', 'PHILIPPINES',
       'CHINA', 'COLUMBIA', 'CAPE VERDE', 'Fiji', 'DOMINICAN REPUBLIC',
       'CAYMAN ISLANDS', 'ARUBA', 'PUERTO RICO', 'ATLANTIC OCEAN',
       'ST. MARTIN', 'TRINIDAD & TOBAGO', 'ISRAEL', 'DIEGO GARCIA',
       'TAIWAN', 'PALESTINIAN TERRITORIES', 'GUAM', 'NIGERIA', 'TONGA',
       'SCOTLAND', 'CROATIA', 'CHILE', 'ANTIGUA', 'RUSSIA',
       'TURKS & CAICOS', 'UNITED ARAB EMIRATES (UAE)', 'AZORES',
       'SOUTH KOREA', 'MALTA', 'SOMALIA', 'NEVIS',
       'BRITISH VIRGIN ISLANDS', 'NORWAY', 'SENEGAL', 'YEMEN',
       'GULF OF ADEN', 'Sierra Leone', 'ST. MAARTIN', 'GRAND CAYMAN',
       'Seychelles', 'LIBERIA', 'MEXICO ', ' TONGA', 'MICRONESIA',
       'CARIBBEAN SEA', 'OKINAWA', 'TANZANIA', 'EGYPT / ISRAEL',
       'NORTHERN ARABIAN SEA', 'HONG KONG', 'EL SALVADOR', 'ANGOLA',
       'MONTENEGRO', 'TUNISIA', 'NAMIBIA', 'NORTH ATLANTIC OCEAN',
       'PORTUGAL', 'SOUTH CHINA SEA', 'BANGLADESH', 'PALAU',
       'WESTERN SAMOA', 'PACIFIC OCEAN ', 'BRITISH ISLES', 'GRENADA',
       'TURKEY', 'NEW BRITAIN', 'JOHNSTON ISLAND', 'SOUTH PACIFIC OCEAN',
       'NEW GUINEA', 'RED SEA', 'FEDERATED STATES OF MICRONESIA',
       'MID ATLANTIC OCEAN', 'ADMIRALTY ISLANDS', 'BRITISH WEST INDIES',
       'SOUTH ATLANTIC OCEAN', 'PERSIAN GULF', 'RED SEA / INDIAN OCEAN',
       'NORTH SEA', 'NICARAGUA ', 'MALDIVE ISLANDS', 'AMERICAN SAMOA',
       'ANDAMAN / NICOBAR ISLANDAS', 'GABON', 'MAYOTTE',
       'NORTH ATLANTIC OCEAN ', 'THE BALKANS', 'SUDAN?', 'ARGENTINA',
       'INDIAN OCEAN', 'GUATEMALA', 'NETHERLANDS ANTILLES',
       'NORTHERN MARIANA ISLANDS', 'IRAN / IRAQ', 'JAVA', 'SIERRA LEONE',
       ' PHILIPPINES', 'CENTRAL PACIFIC', 'SOLOMON ISLANDS / VANUATU',
       'SOUTHWEST PACIFIC OCEAN', 'BAY OF BENGAL', 'MID-PACIFC OCEAN',
       'SLOVENIA', 'CURACAO', 'ITALY / CROATIA', 'HONDURAS', 'MONACO',
       'GUYANA', 'HAITI', 'SAN DOMINGO', 'IRELAND', 'KUWAIT', 'YEMEN ',
       'REUNION ISLAND', 'FALKLAND ISLANDS', 'CRETE', 'CYPRUS', 'EGYPT ',
       'WEST INDIES', 'PARAGUAY', 'BRITISH NEW GUINEA', 'CEYLON', 'OCEAN',
       'GEORGIA', 'SYRIA', 'TUVALU', 'INDIAN OCEAN?', 'ANDAMAN ISLANDS',
       'EQUATORIAL GUINEA / CAMEROON', 'COOK ISLANDS', 'TOBAGO', 'PERU',
       'AFRICA', 'ALGERIA', 'Coast of AFRICA', 'TASMAN SEA', 'GHANA'],
      dtype=object)

In [70]:
df_copia['country'] = df['country'].apply(lambda x: x.lower() if type(x)==str else np.nan)

In [71]:
df_copia['country'].unique()

array(['seychelles', nan, 'england', 'australia', 'barbados', 'jamaica',
       'martinique', 'usa', 'guinea', 'greenland', 'france', 'spain',
       'mediterranean sea', 'cuba', 'sweden', 'panama', 'italy',
       'iceland', 'roatan', 'india', 'between portugal & india',
       'venezuela', 'mexico', 'greece', 'canada', 'kenya', 'uruguay',
       'papua new guinea', 'bermuda', 'lebanon', 'sudan', 'djibouti',
       'libya', 'new zealand', 'vietnam', 'sri lanka', 'mozambique',
       'south africa', 'bahrein', 'bahamas', 'reunion', 'solomon islands',
       'korea', 'french polynesia', 'vanuatu', 'iran', 'red sea?',
       'singapore', 'fiji', 'iraq', 'madagascar', 'indonesia',
       'nicaragua', 'marshall islands', 'kiribati', 'north pacific ocean',
       'saudi arabia', 'pacific ocean', 'burma', 'belize', 'asia?',
       'ceylon (sri lanka)', 'brazil', 'thailand', 'costa rica',
       'maldives', 'new caledonia', 'ecuador', 'malaysia', 'mauritius',
       'samoa', 'japan', 'egypt', 'st helena, british overseas territory',
       'comoros', 'united kingdom', 'united arab emirates', 'philippines',
       'china', 'columbia', 'cape verde', 'dominican republic',
       'cayman islands', 'aruba', 'puerto rico', 'atlantic ocean',
       'st. martin', 'trinidad & tobago', 'israel', 'diego garcia',
       'taiwan', 'palestinian territories', 'guam', 'nigeria', 'tonga',
       'scotland', 'croatia', 'chile', 'antigua', 'russia',
       'turks & caicos', 'united arab emirates (uae)', 'azores',
       'south korea', 'malta', 'somalia', 'nevis',
       'british virgin islands', 'norway', 'senegal', 'yemen',
       'gulf of aden', 'sierra leone', 'st. maartin', 'grand cayman',
       'liberia', 'mexico ', ' tonga', 'micronesia', 'caribbean sea',
       'okinawa', 'tanzania', 'egypt / israel', 'northern arabian sea',
       'hong kong', 'el salvador', 'angola', 'montenegro', 'tunisia',
       'namibia', 'north atlantic ocean', 'portugal', 'south china sea',
       'bangladesh', 'palau', 'western samoa', 'pacific ocean ',
       'british isles', 'grenada', 'turkey', 'new britain',
       'johnston island', 'south pacific ocean', 'new guinea', 'red sea',
       'federated states of micronesia', 'mid atlantic ocean',
       'admiralty islands', 'british west indies', 'south atlantic ocean',
       'persian gulf', 'red sea / indian ocean', 'north sea',
       'nicaragua ', 'maldive islands', 'american samoa',
       'andaman / nicobar islandas', 'gabon', 'mayotte',
       'north atlantic ocean ', 'the balkans', 'sudan?', 'argentina',
       'indian ocean', 'guatemala', 'netherlands antilles',
       'northern mariana islands', 'iran / iraq', 'java', ' philippines',
       'central pacific', 'solomon islands / vanuatu',
       'southwest pacific ocean', 'bay of bengal', 'mid-pacifc ocean',
       'slovenia', 'curacao', 'italy / croatia', 'honduras', 'monaco',
       'guyana', 'haiti', 'san domingo', 'ireland', 'kuwait', 'yemen ',
       'reunion island', 'falkland islands', 'crete', 'cyprus', 'egypt ',
       'west indies', 'paraguay', 'british new guinea', 'ceylon', 'ocean',
       'georgia', 'syria', 'tuvalu', 'indian ocean?', 'andaman islands',
       'equatorial guinea / cameroon', 'cook islands', 'tobago', 'peru',
       'africa', 'algeria', 'coast of africa', 'tasman sea', 'ghana'],
      dtype=object)

In [72]:
df_copia.columns

Index(['case_number', 'year', 'type', 'country', 'activity', 'age', 'species_',
       'mes', 'fatal_', 'sex2'],
      dtype='object')

In [73]:
df_copia. rename(columns = {'sex2':'sex', 'fatal_':'fatal', 'species_':'species'}, inplace = True)

In [74]:
df_copia.columns

Index(['case_number', 'year', 'type', 'country', 'activity', 'age', 'species',
       'mes', 'fatal', 'sex'],
      dtype='object')

In [75]:
lista_columnas = df_copia.columns.to_list()

In [76]:
nuevo_orden = ['case_number', 'year', 'mes','country', 'type', 'activity',
       'age', 'sex', 'species',  'fatal']

In [77]:
df_copia = df_copia.reindex(columns=nuevo_orden)

In [78]:
df_copia.head(2)

,case_number,year,mes,country,type,activity,age,sex,species,fatal
0,1800.00.00,1800,NaN,seychelles,Unprovoked,a corsair's boat was overturned,NaN,F,NaN,y
1,1797.05.28.R,1797,May,NaN,Unprovoked,Dropped overboard,NaN,NaN,NaN,y

In [81]:
len(df_copia['activity'].unique())

1531

In [79]:
df_copia.to_csv('../../datos/attacks_limpio_1.csv')